Саракташ2/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.РасходыНаУслуги</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезерве</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПерезвонить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаСайте</name>
    <comment>Дата заказа на сайте</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПокупателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>CatalogRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиССайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДополнительныхРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидкиССайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаценкаОпт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНаценкуОпт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибыльСЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрибыльСЗаказаСУчетомДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяУказанноеПриОформленииЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗамененныеПозиции</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>НазначениеСкидки</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.МетодыОплаты</types>
        <types>EnumRef.НазначенияСкидок</types>
        <types>CatalogRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Упаковка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Саракташ2/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/AccumulationRegisters/ОжидаемыеТовары/ОжидаемыеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОжидаемыеТовары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.ТипКоличество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/AccumulationRegisters/ТоварыВРезерве/ТоварыВРезерве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВРезерве</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезерва</name>
    <type>
      <types>DocumentRef.РезервированиеТоваров</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/InformationRegisters/ТоварыПоКатегориям/ТоварыПоКатегориям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоварыПоКатегориям</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/Enums/ТипыПравилУпаковки/ТипыПравилУпаковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПравилУпаковки</name>
  <enumValues>
    <name>ДляКаждойПозиции</name>
  </enumValues>
  <enumValues>
    <name>ДляКатегорииПозиции</name>
  </enumValues>
  <enumValues>
    <name>ДляКаждогоЗаказа</name>
  </enumValues>
</mdclass:Enum>

Саракташ2/src/Enums/ВидыЗаказовПокупателей/ВидыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗаказовПокупателей</name>
  <enumValues>
    <name>Розничный</name>
  </enumValues>
  <enumValues>
    <name>Оптовый</name>
  </enumValues>
</mdclass:Enum>

Саракташ2/src/Documents/ЗаказПокупателя/Forms/ФормаДокументаСтарая/Module.bsl
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ОбновитьНаличиеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаличие(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		ПоказатьПредупреждение(,"Не указан склад отправки!",15);
		Возврат;
	КонецЕсли;
	
	ОбновитьНаличиеСервер();
			
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаличиеСервер()
		
	Номенклатура = Новый Массив;
	Для Каждого Стр Из Объект.Товары Цикл
		Номенклатура.Добавить(Стр.Номенклатура);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.КоличествоОстаток КАК ОстатокНаСкладе,
	|	0 КАК ОстатокПоКомпании,
	|	0 КАК ОжидаемыйОстаток,
	|	0 КАК ОстатокВРезерве
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Номенклатура В (&Номенклатура)
	|				И Склад = &СкладОтправки) КАК ЗапасыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗапасыОстатки.Номенклатура,
	|	0,
	|	ЗапасыОстатки.КоличествоОстаток,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			,
	|			Номенклатура В (&Номенклатура)
	|				И Склад <> &СкладОтправки) КАК ЗапасыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОжидаемыеТоварыОстатки.Номенклатура,
	|	0,
	|	0,
	|	ОжидаемыеТоварыОстатки.КоличествоОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ОжидаемыеТовары.Остатки(, Номенклатура В (&Номенклатура)) КАК ОжидаемыеТоварыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВРезервеОстатки.Номенклатура,
	|	0,
	|	0,
	|	0,
	|	ТоварыВРезервеОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВРезерве.Остатки(, Номенклатура В (&Номенклатура)) КАК ТоварыВРезервеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура,
	|	СУММА(вт.ОстатокНаСкладе) КАК ОстатокНаСкладе,
	|	СУММА(вт.ОстатокПоКомпании) КАК ОстатокПоКомпании,
	|	СУММА(вт.ОжидаемыйОстаток) КАК ОжидаемыйОстаток,
	|	СУММА(вт.ОстатокВРезерве) КАК ОстатокВРезерве
	|ИЗ
	|	вт КАК вт
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Номенклатура";
	Запрос.УстановитьПараметр("СкладОтправки",Объект.Склад);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	РезультатВыгрузка = Запрос.Выполнить().Выгрузить();      
	
	Для Каждого Стр Из Объект.Товары Цикл
		Найдено = РезультатВыгрузка.Найти(Стр.Номенклатура,"Номенклатура");
		Если Найдено <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Стр,Найдено);	
		Иначе
			Стр.ОстатокНаСкладе = 0;
			Стр.ОстатокПоКомпании = 0;
			Стр.ОжидаемыйОстаток = 0;
			Стр.ОстатокВРезерве = 0;  			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоматическиУпаковку(Команда)
	
	Если Объект.Упаковка.Количество() > 0 Тогда
		спВарианты = Новый СписокЗначений;
		спВарианты.Добавить("Заполнить заново","Заполнить заново");
		спВарианты.Добавить("Добавить к существующим","Добавить к существующим");
		спВарианты.Добавить("Отмена","Отмена");
		Оповещение = Новый ОписаниеОповещения("ВопросУпаковкаНеПустаяПродолжение",ЭтаФорма);
		ПоказатьВопрос(Оповещение,"Табличная часть ""Упаковка"" не пустая, выберите вариант действия!",спВарианты,35,спВарианты[0],"Внимание!",спВарианты[3]);
	Иначе
		ЗаполнитьУпаковкуПоПравилам();
		ОбновитьЗаголовки();
	КонецЕсли;           	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУпаковкаНеПустаяПродолжение(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РезультатВопроса) ИЛИ РезультатВопроса = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУпаковкуПоПравилам(РезультатВопроса = "Заполнить заново");
	ОбновитьЗаголовки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУпаковкуПоПравилам(Знач Заново = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тчТовары.Номенклатура,
	|	тчТовары.Количество
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&тчТовары КАК тчТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура,
	|	СУММА(втТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыСвернутые
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыСвернутые.Номенклатура,
	|	ТоварыСвернутые.Количество,
	|	ЕСТЬNULL(ТоварыПоКатегориям.Категория, ЗНАЧЕНИЕ(Справочник.КатегорииТоваров.ПустаяСсылка)) КАК Категория
	|ПОМЕСТИТЬ ТоварыКатегории
	|ИЗ
	|	ТоварыСвернутые КАК ТоварыСвернутые
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыПоКатегориям КАК ТоварыПоКатегориям
	|		ПО ТоварыСвернутые.Номенклатура = ТоварыПоКатегориям.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|	ПравилаУпаковкиЗаказов.Упаковка,
	|	ПравилаУпаковкиЗаказов.КоличествоУпаковка,
	|	3 КАК Приоритет
	|ПОМЕСТИТЬ Правила
	|ИЗ
	|	РегистрСведений.ПравилаУпаковкиЗаказов КАК ПравилаУпаковкиЗаказов
	|ГДЕ
	|	ПравилаУпаковкиЗаказов.ТипПравила = ЗНАЧЕНИЕ(Перечисление.ТипыПравилУпаковки.ДляКаждогоЗаказа)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКатегории.Номенклатура,
	|	ПравилаУпаковкиЗаказов.Упаковка,
	|	ТоварыКатегории.Количество / ПравилаУпаковкиЗаказов.КоличествоТовара * ПравилаУпаковкиЗаказов.КоличествоУпаковка,
	|	2
	|ИЗ
	|	РегистрСведений.ПравилаУпаковкиЗаказов КАК ПравилаУпаковкиЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыКатегории КАК ТоварыКатегории
	|		ПО (ПравилаУпаковкиЗаказов.ТипПравила = ЗНАЧЕНИЕ(Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции))
	|			И ПравилаУпаковкиЗаказов.Номенклатура = ТоварыКатегории.Категория
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыСвернутые.Номенклатура,
	|	ПравилаУпаковкиЗаказов.Упаковка,
	|	ТоварыСвернутые.Количество / ПравилаУпаковкиЗаказов.КоличествоТовара * ПравилаУпаковкиЗаказов.КоличествоУпаковка,
	|	1
	|ИЗ
	|	РегистрСведений.ПравилаУпаковкиЗаказов КАК ПравилаУпаковкиЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСвернутые КАК ТоварыСвернутые
	|		ПО (ПравилаУпаковкиЗаказов.ТипПравила = ЗНАЧЕНИЕ(Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции))
	|			И ПравилаУпаковкиЗаказов.Номенклатура = ТоварыСвернутые.Номенклатура
	|			И ПравилаУпаковкиЗаказов.КоличествоТовара <= ТоварыСвернутые.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Правила.Номенклатура,
	|	Правила.Упаковка,
	|	МИНИМУМ(Правила.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ДействующиеПриоритеты
	|ИЗ
	|	Правила КАК Правила
	|
	|СГРУППИРОВАТЬ ПО
	|	Правила.Номенклатура,
	|	Правила.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеПриоритеты.Упаковка,
	|	СУММА(Правила.КоличествоУпаковка) КАК КоличествоУпаковка
	|ИЗ
	|	Правила КАК Правила
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДействующиеПриоритеты КАК ДействующиеПриоритеты
	|		ПО Правила.Номенклатура = ДействующиеПриоритеты.Номенклатура
	|			И Правила.Упаковка = ДействующиеПриоритеты.Упаковка
	|			И Правила.Приоритет = ДействующиеПриоритеты.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	ДействующиеПриоритеты.Упаковка";
	тчТовары = Объект.Товары.Выгрузить(,"Номенклатура,Количество");
	Запрос.УстановитьПараметр("тчТовары",тчТовары);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Заново Тогда
		Объект.Упаковка.Очистить();	
	КонецЕсли;
	Для Каждого Стр Из Рез Цикл
		Если Стр.КоличествоУпаковка <= 0 Тогда
			Продолжить;
		КонецЕсли;
		нс = Объект.Упаковка.Добавить();
		нс.Номенклатура = Стр.Упаковка;
		нс.Количество = Стр.КоличествоУпаковка;
	КонецЦикла; 	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовки()
	
	Элементы.ГруппаТовары.Заголовок = "Товары (на "+Формат(Объект.Товары.Итог("Сумма"),"ЧЦ=15; ЧДЦ=2; ЧН=0.00")+"руб.)";
	Элементы.ГруппаУпаковка.Заголовок = "Упаковка (на "+Формат(Объект.Упаковка.Итог("Сумма"),"ЧЦ=15; ЧДЦ=2; ЧН=0.00")+"руб.)";
	Элементы.ГруппаДоставка.Заголовок = "Услуги (на "+Формат(Объект.Услуги.Итог("Сумма"),"ЧЦ=15; ЧДЦ=2; ЧН=0.00")+"руб.)";
	//Выручка = Объект.Товары.Итог("Сумма")-Объект.Упаковка.Итог("Сумма")-Объект.СтоимостьДоставки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если Объект.Упаковка.Количество() = 0
			И Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовПокупателей.Розничный")
				И Объект.Статус = ПредопределенноеЗначение("Справочник.СтатусыЗаказов.Новый") Тогда
		ЗаполнитьУпаковкуПоПравилам();
		Сообщить("В заказ была автоматически рассчитана упаковка!");
		Если Объект.Упаковка.Количество() > 0 Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	ОбновитьЗаголовки();
	
	УстановитьВидимость();
	
	УстановитьОтборКонтрагентов();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	//Элементы.IDНаСайте.Видимость = (Объект.IDНаСайте<>0);
	ЭтоОптовыйЗаказ = Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовПокупателей.Оптовый");
	Элементы.ТранспортнаяКомпания.Видимость = ЭтоОптовыйЗаказ; 
	Элементы.ФормаСчетНаОплату.Видимость = ЭтоОптовыйЗаказ;
	//Элементы.
	
КонецПроцедуры
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновитьЗаголовки();
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	
	ОбновитьЗаголовки();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	
	ОбновитьЗаголовки();
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьДоставкиПриИзменении(Элемент)
	
	ОбновитьЗаголовки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Клиент.РассчитатьСуммуТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПроцентСкидкиПриИзменении(Элемент)
	
	Клиент.РассчитатьСуммуТЧПоСкидке(Элементы.Товары.ТекущиеДанные); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаСкидкиПриИзменении(Элемент)
	
	Клиент.РассчитатьСуммуТЧПоСкидке(Элементы.Товары.ТекущиеДанные, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)	
	
	УстановитьОтборКонтрагентов();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборКонтрагентов()
	
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Покупатель", Истина));
	Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовПокупателей.Оптовый") Тогда
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Опт", Истина));
	ИначеЕсли Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказовПокупателей.Розничный") Тогда
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Розница", Истина));
	КонецЕсли; 
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Контрагент.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры

&НаКлиенте
Процедура СчетНаОплату(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Документ необходимо записать!");
		Возврат;
	КонецЕсли;
	
	ТабДок = ПечатьСчетаНаОплату();
	ТабДок.Показать("Счет на оплату по заказу покупателя №"+Объект.Номер+" от "+Объект.Дата);     	
	
КонецПроцедуры

&НаСервере
Функция ПечатьСчетаНаОплату()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ДокументОбъект.ПечатьСчетаНаОплату();
	
КонецФункции

&НаКлиенте
Процедура Торг12(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Документ необходимо записать!");
		Возврат;
	КонецЕсли;
	
	ТабДок = ПечатьТорг12();
	ТабДок.Показать("ТОРГ-12 по заказу покупателя №"+Объект.Номер+" от "+Объект.Дата);

КонецПроцедуры

&НаСервере
Функция ПечатьТорг12()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ДокументОбъект.ПечатьТорг12();
	
КонецФункции
